<?php

return [
    'canceled_by_user'             => 'تراکنش بانکی توسط کاربر لغو شد',
    'could_not_request_token'      => 'امکان درخواست توکن برای این تراکنش وجود ندارد',
    'could_not_verify_transaction' => 'امکان تایید این تراکنش وجود ندارد',
    'could_not_inquiry_payment'    => 'امکان استعلام این تراکنش وجود ندارد',
    'could_not_settle_payment'     => 'امکان تسویه برای این تراکنش وجود ندارد',
    'could_not_refund_payment'     => 'امکان برگشت زدن این تراکنش وجود ندارد',
    'gate_not_ready'               => 'درگاه پرداختی یا وجود ندارد یا آماده سرویس دهی نمی باشد',
    'goto_gate'                    => 'انتقال به درگاه پرداخت',
    'invalid_response'             => 'پاسخ معتبر از سرور درگاه پرداخت دریافت نشد!',
    'token_failed'                 => 'درخواست توکن تراکنش با موفقیت انجام نشد!',
    'verify_failed'                => 'تایید تراکنش با موفقیت انجام نشد!',
    'inquiry_failed'               => 'بررسی وضعیت تراکنش با موفقیت انجام نشد!',
    'settle_failed'                => 'تایید بعد از تراکنش با موفقیت انجام نشد!',
    'refund_failed'                => 'بازگشت تراکنش با موفقیت انجام نشد!',
];
